#pragma once

// Outlast (1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class OLGame.ActorFactoryOLAmbientSound
// 0x0000 (0x00A4 - 0x00A4)
class UActorFactoryOLAmbientSound : public UActorFactoryAkAmbientSound
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.ActorFactoryOLAmbientSound");
		return ptr;
	}

};


// Class OLGame.ActorFactoryOLSoundEmittingMeshActor
// 0x0010 (0x00C0 - 0x00B0)
class UActorFactoryOLSoundEmittingMeshActor : public UActorFactoryStaticMesh
{
public:
	class UAkEvent*                                    StartEvent;                                               // 0x00B0(0x0008) (Edit)
	class UAkEvent*                                    StopEvent;                                                // 0x00B8(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.ActorFactoryOLSoundEmittingMeshActor");
		return ptr;
	}

};


// Class OLGame.OLAmbientSound
// 0x0014 (0x0268 - 0x0254)
class AOLAmbientSound : public AAkAmbientSound
{
public:
	unsigned long                                      bAllowVirtualization : 1;                                 // 0x0254(0x0004) (Edit)
	TArray<class AOLAmbientSoundClone*>                Clones;                                                   // 0x0258(0x0010) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLAmbientSound");
		return ptr;
	}

};


// Class OLGame.OLAmbientSoundClone
// 0x0014 (0x0254 - 0x0240)
class AOLAmbientSoundClone : public AActor
{
public:
	class USpriteComponent*                            SpriteComp;                                               // 0x0240(0x0008) (ExportObject, Component, EditInline)
	class AOLAmbientSound*                             Master;                                                   // 0x0248(0x0008) (Edit, EditConst)
	unsigned long                                      bAllowVirtualization : 1;                                 // 0x0250(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLAmbientSoundClone");
		return ptr;
	}

};


// Class OLGame.OLBashableObject
// 0x0058 (0x0298 - 0x0240)
class AOLBashableObject : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObject;                     // 0x0240(0x0008) (Const, Native, NoExport)
	TEnumAsByte<EOLBashableType>                       BashableType;                                             // 0x0248(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0249(0x0003) MISSED OFFSET
	class UStaticMeshComponent*                        PreBashCollision;                                         // 0x024C(0x0008) (Edit, ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        PostBashCollision;                                        // 0x0254(0x0008) (Edit, ExportObject, Component, EditInline)
	class USkeletalMeshComponent*                      Mesh;                                                     // 0x025C(0x0008) (Edit, ExportObject, Component, EditInline)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0264(0x0008) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BashAnimation;                                            // 0x026C(0x0008) (Edit)
	float                                              PathPointOffset;                                          // 0x0274(0x0004) (Edit)
	float                                              BashYOffset;                                              // 0x0278(0x0004) (Edit)
	unsigned long                                      bEnabled : 1;                                             // 0x027C(0x0004) (Edit)
	unsigned long                                      bBroken : 1;                                              // 0x027C(0x0004)
	unsigned long                                      bInitiallyEnabled : 1;                                    // 0x027C(0x0004) (Transient)
	struct FVector                                     Edge0Dest;                                                // 0x0280(0x000C)
	struct FVector                                     Edge1Dest;                                                // 0x028C(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLBashableObject");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
	void ClearBreakTimer();
	void TriggerBreakTimer(float Time);
	void Break();
};


// Class OLGame.OLCamcorderHud
// 0x0060 (0x0244 - 0x01E4)
class UOLCamcorderHud : public UGFxMoviePlayer
{
public:
	class AOLHUD*                                      HUD;                                                      // 0x01E4(0x0008)
	unsigned long                                      bVisible : 1;                                             // 0x01EC(0x0004)
	float                                              RecordingTimeSeconds;                                     // 0x01F0(0x0004)
	struct FCamcorderHudObjects                        Objects;                                                  // 0x01F4(0x0038) (Transient)
	struct FCamcorderHudState                          HudState;                                                 // 0x022C(0x0018) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCamcorderHud");
		return ptr;
	}


	void UpdateRecordingTime(float DeltaTime);
	bool WidgetInitialized(const struct FName& WidgetName, const struct FName& WidgetPath, class UGFxObject* Widget);
	void SetVisible(bool bShow);
};


// Class OLGame.OLCameraActor
// 0x0000 (0x03C8 - 0x03C8)
class AOLCameraActor : public ACameraActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCameraActor");
		return ptr;
	}


	void GetCameraView(float DeltaTime, struct FTPOV* OutPOV);
	void NativeGetCameraView(struct FTPOV* OutPOV);
};


// Class OLGame.OLTypes
// 0x0000 (0x0060 - 0x0060)
class UOLTypes : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLTypes");
		return ptr;
	}

};


// Class OLGame.OLPlayerController
// 0x031C (0x0D68 - 0x0A4C)
class AOLPlayerController : public AUDKPlayerController
{
public:
	class AOLHero*                                     HeroPawn;                                                 // 0x0A4C(0x0008)
	class AOLHUD*                                      HUD;                                                      // 0x0A54(0x0008)
	class UOLInventoryManager*                         InventoryManager;                                         // 0x0A5C(0x0008)
	class UOLTutorialManager*                          TutorialManager;                                          // 0x0A64(0x0008)
	class UOLSoundEnvironmentManager*                  SoundEnvManager;                                          // 0x0A6C(0x0008)
	class UOLFXManager*                                FXManager;                                                // 0x0A74(0x0008)
	class UOLSeqAct_SplashScreen*                      ActiveSplashScreen;                                       // 0x0A7C(0x0008)
	unsigned long                                      bFlushingStreaming : 1;                                   // 0x0A84(0x0004)
	unsigned long                                      bHasCamcorder : 1;                                        // 0x0A84(0x0004)
	unsigned long                                      bBlockedOnLoading : 1;                                    // 0x0A84(0x0004)
	unsigned long                                      bShowingKismetControlledLoadingScreen : 1;                // 0x0A84(0x0004)
	unsigned long                                      bShowingLoadingOverlay : 1;                               // 0x0A84(0x0004)
	unsigned long                                      bProfileSettingsUpdated : 1;                              // 0x0A84(0x0004)
	unsigned long                                      bValidDoorHold : 1;                                       // 0x0A84(0x0004)
	unsigned long                                      bInvalidateLeanInput : 1;                                 // 0x0A84(0x0004)
	unsigned long                                      bInvalidateReleasedUse : 1;                               // 0x0A84(0x0004)
	unsigned long                                      bToggleCrouch : 1;                                        // 0x0A84(0x0004)
	unsigned long                                      bOverriddenMusic : 1;                                     // 0x0A84(0x0004)
	unsigned long                                      bTravellingToCheckpoint : 1;                              // 0x0A84(0x0004)
	unsigned long                                      bTravelCheckPersistent : 1;                               // 0x0A84(0x0004)
	unsigned long                                      bForceLevelReset : 1;                                     // 0x0A84(0x0004)
	unsigned long                                      bFoundBySoldierWhileHidden : 1;                           // 0x0A84(0x0004)
	unsigned long                                      bFoundBySurgeonWhileHidden : 1;                           // 0x0A84(0x0004)
	unsigned long                                      bEnableShadowOptimisation : 1;                            // 0x0A84(0x0004) (Config)
	unsigned long                                      bEnableLightOptimisation : 1;                             // 0x0A84(0x0004) (Config)
	unsigned long                                      bBehindView : 1;                                          // 0x0A84(0x0004)
	unsigned long                                      bDebugFixedCam : 1;                                       // 0x0A84(0x0004)
	unsigned long                                      bDebugFreeCam : 1;                                        // 0x0A84(0x0004)
	unsigned long                                      bDebugGhost : 1;                                          // 0x0A84(0x0004)
	unsigned long                                      bSlowDownFPS : 1;                                         // 0x0A84(0x0004)
	struct FName                                       CurrentObjective;                                         // 0x0A88(0x0008)
	TArray<struct FName>                               CompletedObjectives;                                      // 0x0A90(0x0010) (NeedCtorLink)
	int                                                NumBatteries;                                             // 0x0AA0(0x0004)
	int                                                MaxNumBatteries;                                          // 0x0AA4(0x0004)
	int                                                NrmMaxNumBatteries;                                       // 0x0AA8(0x0004) (Config)
	int                                                HardMaxNumBatteries;                                      // 0x0AAC(0x0004) (Config)
	int                                                NightmareMaxNumBatteries;                                 // 0x0AB0(0x0004) (Config)
	int                                                DefaultNumBatteries;                                      // 0x0AB4(0x0004) (Config)
	float                                              GameOverActivatedTimestamp;                               // 0x0AB8(0x0004)
	TArray<TEnumAsByte<EPlayerInteractionType>>        AvailableInteractions;                                    // 0x0ABC(0x0010) (NeedCtorLink)
	struct FString                                     CSAPrompt;                                                // 0x0ACC(0x0010) (NeedCtorLink)
	struct FString                                     PickupTargetName;                                         // 0x0ADC(0x0010) (NeedCtorLink)
	class UOLProfileSettings*                          ProfileSettings;                                          // 0x0AEC(0x0008)
	struct FDigitalInputs                              Inputs;                                                   // 0x0AF4(0x0004)
	unsigned char                                      bLeanInputLeft;                                           // 0x0AF8(0x0001) (Input)
	unsigned char                                      bLeanInputRight;                                          // 0x0AF9(0x0001) (Input)
	unsigned char                                      bRunInput;                                                // 0x0AFA(0x0001) (Input)
	unsigned char                                      bUseButtonDown;                                           // 0x0AFB(0x0001) (Input)
	TEnumAsByte<EAIMusicState>                         AIMusic;                                                  // 0x0AFC(0x0001)
	TEnumAsByte<EAIMusicState>                         OverriddenMusicState;                                     // 0x0AFD(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0AFE(0x0002) MISSED OFFSET
	float                                              PureMouseX;                                               // 0x0B00(0x0004) (Input)
	float                                              AnalogLeanInputLeft;                                      // 0x0B04(0x0004) (Input)
	float                                              AnalogLeanInputRight;                                     // 0x0B08(0x0004) (Input)
	int                                                ZoomInput;                                                // 0x0B0C(0x0004)
	float                                              UsePressedTime;                                           // 0x0B10(0x0004)
	struct FVector                                     LastPlayerInputIntent;                                    // 0x0B14(0x000C)
	struct FTouchZoomData                              TouchZoom;                                                // 0x0B20(0x0014)
	struct FLinearColor                                LightBarColor;                                            // 0x0B34(0x0010)
	float                                              LightBarPulsePhase;                                       // 0x0B44(0x0004)
	TArray<struct FName>                               CompletedRecordingMoments;                                // 0x0B48(0x0010) (NeedCtorLink)
	TArray<struct FName>                               UnreadRecordingMoments;                                   // 0x0B58(0x0010) (NeedCtorLink)
	class AOLRecordingMarker*                          PendingRecordingMarker;                                   // 0x0B68(0x0008)
	float                                              RecordingCompletedTime;                                   // 0x0B70(0x0004)
	struct FStruggleData                               Struggle;                                                 // 0x0B74(0x00CC) (Transient, NeedCtorLink)
	float                                              StruggleInputThresholdForWin;                             // 0x0C40(0x0004) (Config)
	float                                              StruggleShakesThresholdForWin;                            // 0x0C44(0x0004) (Config)
	float                                              StruggleInputThresholdForWinNoFail;                       // 0x0C48(0x0004) (Config)
	float                                              StruggleShakesThresholdForWinNoFail;                      // 0x0C4C(0x0004) (Config)
	float                                              AIDistance;                                               // 0x0C50(0x0004)
	float                                              OverriddenMusicDistance;                                  // 0x0C54(0x0004)
	float                                              AIChaseMusicTimer;                                        // 0x0C58(0x0004)
	float                                              AIChaseMusicTimeDelay;                                    // 0x0C5C(0x0004) (Config)
	struct FName                                       MusicAIStateGroup;                                        // 0x0C60(0x0008) (Const)
	struct FName                                       MusicAIStateNone;                                         // 0x0C68(0x0008) (Const)
	struct FName                                       MusicAIStatePatrol;                                       // 0x0C70(0x0008) (Const)
	struct FName                                       MusicAIStateInvestigate;                                  // 0x0C78(0x0008) (Const)
	struct FName                                       MusicAIStateChase;                                        // 0x0C80(0x0008) (Const)
	struct FName                                       LoadingStateGroup;                                        // 0x0C88(0x0008) (Const)
	struct FName                                       LoadingStateOn;                                           // 0x0C90(0x0008) (Const)
	struct FName                                       LoadingStateOff;                                          // 0x0C98(0x0008) (Const)
	struct FName                                       AIDistanceRTPC;                                           // 0x0CA0(0x0008) (Const)
	class UAkEvent*                                    SndResetMixStates;                                        // 0x0CA8(0x0008) (Const)
	int                                                NumDeathsSinceLastCheckpoint;                             // 0x0CB0(0x0004)
	float                                              StableLevelsTimestamp;                                    // 0x0CB4(0x0004)
	int                                                NumBatteriesAtLastCheckpoint;                             // 0x0CB8(0x0004)
	float                                              BatteryEnergyAtLastCheckpoint;                            // 0x0CBC(0x0004)
	struct FName                                       FirstSoldierFindableCheckpoint;                           // 0x0CC0(0x0008) (Config)
	struct FName                                       FirstSurgeonFindableCheckpoint;                           // 0x0CC8(0x0008) (Config)
	int                                                FindHiddenPlayerSkipCount;                                // 0x0CD0(0x0004)
	struct FVector                                     LastLightOptimCamPos;                                     // 0x0CD4(0x000C)
	TArray<struct FName>                               LevelsResetAfterPlayerDeath;                              // 0x0CE0(0x0010) (NeedCtorLink)
	struct FVector                                     DesiredLocation;                                          // 0x0CF0(0x000C)
	float                                              LastCameraTimeStamp;                                      // 0x0CFC(0x0004)
	class UClass*                                      MatineeCameraClass;                                       // 0x0D00(0x0008)
	class AActor*                                      CalcViewActor;                                            // 0x0D08(0x0008)
	struct FVector                                     CalcViewActorLocation;                                    // 0x0D10(0x000C)
	struct FRotator                                    CalcViewActorRotation;                                    // 0x0D1C(0x000C)
	struct FVector                                     CalcViewLocation;                                         // 0x0D28(0x000C)
	struct FRotator                                    CalcViewRotation;                                         // 0x0D34(0x000C)
	float                                              OnFootDefaultFOV;                                         // 0x0D40(0x0004) (Config, GlobalConfig)
	struct FRotator                                    DebugCamRot;                                              // 0x0D44(0x000C)
	struct FVector                                     DebugCamPos;                                              // 0x0D50(0x000C)
	float                                              DebugFreeCamSpeed;                                        // 0x0D5C(0x0004)
	float                                              DebugFreeCamFOV;                                          // 0x0D60(0x0004)
	float                                              SlowDownFactor;                                           // 0x0D64(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLPlayerController");
		return ptr;
	}


	void UnlockAchievement(TEnumAsByte<EOutlastAchievement> achievement);
	void NotifyDifficultyChanged();
	void UpdateDifficultyBasedValues();
	void CheckForProfileUpdate();
	void UpdateLocalCacheOfProfileSettings(class UOLProfileSettings* EffectiveProfileSettings);
	void ClientSaveAllPlayerData(bool bShouldForce, bool bSkipCacheUpdate);
	void OnProfileWriteComplete(unsigned char LocalUserNum, bool bWasSuccessful);
	void ClearSaveProfileDelegate(int ControllerId, const struct FScriptDelegate& WriteProfileSettingsCompleteDelegate);
	void SaveProfile();
	void UnregisterPlayerDataStores();
	void RegisterCustomPlayerDataStores();
	bool ShippingCheat_GiveAllCheckpoints();
	void ClearAllProgress();
	void SaveBeforeQuitting();
	void ClientCommitMapChange();
	void StartNewGameAtCheckpoint(const struct FString& CheckpointStr, bool bSaveToDisk);
	void ApplyDeprecatedCheckpointRecord(struct FDeprecatedCheckpointRecord* OldRecord);
	void ApplyCheckpointRecord(struct AOLPlayerController_FCheckpointRecord* Record);
	void CreateCheckpointRecord(struct AOLPlayerController_FCheckpointRecord* Record);
	void NativeApplyCheckpointRecord(struct AOLPlayerController_FCheckpointRecord* Record);
	void NativeCreateCheckpointRecord(struct AOLPlayerController_FCheckpointRecord* Record);
	void SavePersistentState();
	void OnOverrideAIMusic(class UOLSeqAct_OverrideAIMusic* Action);
	void StopAllSounds();
	void DisplayDebug(class AHUD* H, float* out_YL, float* out_YPos);
	void DrawHUD(class AHUD* H);
	void FullScreenOverlayChanged();
	void ForcePause(bool bPause);
	void ClientSetHUD(class UClass* newHUDType);
	void OnSetMesh(class USeqAct_SetMesh* Action);
	void ClientSetCameraFade(bool _enableFading, const struct FColor& _FadeColor, const struct FVector2D& _FadeAlpha, float _FadeTime, bool _fadeAudio);
	void SetCinematicMode(class USeqAct_ToggleCinematicMode* Action, bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsButtons);
	void GetPlayerViewPoint(struct FVector* POVLocation, struct FRotator* POVRotation);
	float GetFOVAngle();
	void SpawnCamera();
	void SetCameraMode(const struct FName& NewCamMode);
	bool UsingFirstPersonCamera();
	void SetBehindView(bool bNewBehindView);
	void BehindView();
	void GammaCalibration();
	void PressedJump();
	void PressedReloadBatteries();
	void StopZoom();
	void StartZoomOut();
	void StartZoomIn();
	void ZoomOut();
	void ZoomIn();
	void ToggleCamcorder();
	void ToggleNightVision();
	void ReleasedUseButton();
	void PressedUseButton();
	bool PerformedUseAction();
	void SetPlayerFoundWhileHidden(class AOLEnemyPawn* SearchingEnemy);
	bool IsPlayerFindableWhileHidden(class AOLEnemyPawn* SearchingEnemy);
	void PlayerDied();
	void Destroyed();
	void ClientRestart(class APawn* NewPawn);
	void Reset();
	void UnPossess();
	void Possess(class APawn* inPawn, bool bVehicleTransition);
	void PostBeginPlay();
	void HideLoadingOverlay();
	void ShowLoadingOverlay();
	void SetVolume(float VolumeLevel);
	void SetGamma(float GammaValue);
	float GetGamma();
	void NativePlayerMove(float DeltaTime);
};


// Class OLGame.OLCheatManager
// 0x0030 (0x00D0 - 0x00A0)
class UOLCheatManager : public UGameCheatManager
{
public:
	int                                                GameSpeedLevel;                                           // 0x00A0(0x0004)
	unsigned long                                      bCheatsEnabled : 1;                                       // 0x00A4(0x0004) (Config)
	unsigned long                                      bUnlimitedBatteries : 1;                                  // 0x00A4(0x0004) (Config)
	unsigned long                                      bDebugGameplay : 1;                                       // 0x00A4(0x0004)
	unsigned long                                      bDebugSoundEnvironment : 1;                               // 0x00A4(0x0004)
	unsigned long                                      bDebugGameState : 1;                                      // 0x00A4(0x0004)
	unsigned long                                      bDebugCamera : 1;                                         // 0x00A4(0x0004)
	unsigned long                                      bDebugTrajectory : 1;                                     // 0x00A4(0x0004)
	unsigned long                                      bDrawDebugAI : 1;                                         // 0x00A4(0x0004)
	unsigned long                                      bDebugWaitPoints : 1;                                     // 0x00A4(0x0004) (Config)
	unsigned long                                      bMuted : 1;                                               // 0x00A4(0x0004) (Config)
	unsigned long                                      bDebugAIPositions : 1;                                    // 0x00A4(0x0004) (Config)
	unsigned long                                      bSuppressAllMessages : 1;                                 // 0x00A4(0x0004) (Config)
	unsigned long                                      bPausedForFreeCam : 1;                                    // 0x00A4(0x0004)
	struct FString                                     DebugSoundEnvFilter;                                      // 0x00A8(0x0010) (NeedCtorLink)
	float                                              NextSpikeTime;                                            // 0x00B8(0x0004)
	float                                              AutoSpikeDelay;                                           // 0x00BC(0x0004)
	TArray<struct FDebugTrajectoryPoint>               DebugTrajectoryPoints;                                    // 0x00C0(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCheatManager");
		return ptr;
	}


	void SetLanguage(const struct FString& LanguageCode);
	void ReloadSoundBanks(bool bDLC);
	bool ProcessCheatInput(class UOLPlayerInput* InputMgr, const struct FName& Key);
	bool IsViewModeUnlit();
	void SetFinishedGame(bool hasFinishedGame, bool hasFinishedDLC);
	void OutlastPause();
	void ResetGS();
	void ActivateGS(const struct FName& gsName);
	void DumpGS();
	void DebugGameState();
	void SuppressAllMessages();
	void DrawDebug();
	void ToggleMute();
	void InflictDamage(float Amount);
	void ResetWorldState();
	void ResetPushables();
	void ResetDoors();
	void SetGamma(float newGamma);
	void DemoMode();
	void LoadGame(const struct FString& Filename);
	void SaveGame(const struct FString& Filename);
	void GiveItem(const struct FString& ItemName);
	void ApplyCP(const struct FString& CPName);
	void cplist();
	void cp(const struct FString& CPName);
	void Checkpoint(const struct FString& CPName);
	void KillFade();
	void ToggleUnlimitedBatteries();
	void RechargeNightVision();
	void Ghost();
	void GhostPawn(bool ghosting);
	void FasterGameSpeed();
	void SlowerGameSpeed();
	void NormalGameSpeed();
	void UpdateGameSpeed();
	void SingleFrame();
	void TeleportToFreeCam();
	void ToggleFixedCam();
	void ToggleFreeCamNoPause();
	void ToggleFreeCam();
	void AutoSpike(float Spike, float Delay);
	void Spike(float Spike);
	void BadFPS(float slowdown);
	void DebugAIPositions();
	void DebugAI();
	void ShowHeroDebug();
	void ShowPaths();
	void ShowStatLevels();
	void DebugWaitPoints();
	void DebugTrajectory();
	void DebugCamera();
	void DebugSoundEnvironment(const struct FString& Filter);
	void DebugGameplay();
	void SaveAllCheckpoints();
	void DeleteAllSaves();
	void KillAll(class UClass* aClass);
	void ToggleCheats();
	class UOLCheatManager* STATIC_GetCheatManager();
	void AddDebugTrajectoryPoint(const struct FDebugTrajectoryPoint& Point);
};


// Class OLGame.OLCheckpoint
// 0x0014 (0x037C - 0x0368)
class AOLCheckpoint : public APlayerStart
{
public:
	struct FName                                       CheckpointName;                                           // 0x0368(0x0008) (Edit)
	unsigned long                                      bKillAllEnemies : 1;                                      // 0x0370(0x0004) (Edit)
	struct FName                                       PersistentLevelName;                                      // 0x0374(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCheckpoint");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
	void SetEnabled(bool bEnable);
	void ResetCheckpointDeaths();
	void OnPlayerSpawn();
};


// Class OLGame.OLCheckpointList
// 0x0011 (0x0251 - 0x0240)
class AOLCheckpointList : public AActor
{
public:
	TArray<struct FName>                               CheckpointList;                                           // 0x0240(0x0010) (Edit, NeedCtorLink)
	TEnumAsByte<EOutlastGameType>                      GameType;                                                 // 0x0250(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCheckpointList");
		return ptr;
	}


	bool STATIC_Script_IsUnreached(struct FName* TestCheckpoint, struct FName* CurrentCheckpoint);
};


// Class OLGame.OLEngine
// 0x0058 (0x0AEC - 0x0A94)
class UOLEngine : public UGameEngine
{
public:
	TArray<struct FSaveFileInfo>                       SaveFiles;                                                // 0x0A94(0x0010) (NeedCtorLink)
	struct FName                                       PendingCheckpointName;                                    // 0x0AA4(0x0008)
	TEnumAsByte<ECheckpointAction>                     PendingCheckpointAction;                                  // 0x0AAC(0x0001)
	TEnumAsByte<EOrbisDialogType>                      ActiveOrbisDialog;                                        // 0x0AAD(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0AAE(0x0002) MISSED OFFSET
	unsigned long                                      bRestartingActiveCheckpoint : 1;                          // 0x0AB0(0x0004)
	unsigned long                                      bPendingGraphicalSettingsChange : 1;                      // 0x0AB0(0x0004)
	unsigned long                                      bDisableMotionBlur : 1;                                   // 0x0AB0(0x0004) (Config)
	unsigned long                                      bPausedForSystemDialog : 1;                               // 0x0AB0(0x0004)
	class UOLCheckpointSave*                           CurrentCheckpointSave;                                    // 0x0AB4(0x0008)
	int                                                PendingNewLanguage;                                       // 0x0ABC(0x0004)
	class UAkEvent*                                    StartupMovieSound;                                        // 0x0AC0(0x0008)
	float                                              NextRefreshDLCTime;                                       // 0x0AC8(0x0004)
	TArray<unsigned char>                              SaveDataBuffer;                                           // 0x0ACC(0x0010) (NeedCtorLink)
	struct FScriptDelegate                             __SaveDataDialogDoneCallback__Delegate;                   // 0x0ADC(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLEngine");
		return ptr;
	}


	bool UpdateProfileKeyBindingsFromSystem(class UOLProfileSettings* ProfileSettings);
	bool UpdateProfileFromSystemSettings(class UOLProfileSettings* ProfileSettings);
	bool ApplyKeyBindings(class UOLProfileSettings* ProfileSettings);
	bool ApplySystemSettings(class UOLProfileSettings* ProfileSettings);
	bool LoadMostRecentSaveFile();
	bool LoadCurrentSaveFile();
	void RefreshSaveFiles();
	void DeleteSaveFile(const struct FString& Filename);
	bool LoadSaveFile(const struct FString& Filename);
	void DebugLoadGame(const struct FString& Filename);
	void DebugSaveGame(const struct FString& Filename);
	bool HasValidSaveGame();
	void SaveAllCheckpoints();
	void SaveCheckpointImmediate(const struct FName& CheckpointName);
	void SaveCheckpoint(const struct FName& CheckpointName, bool bSaveToDisk);
	void StartCurrentCheckpoint();
	void SelectAndLoadGame(const struct FScriptDelegate& Callback);
	void NativeSelectAndLoadGame();
	void SelectSaveLocation(const struct FString& startCP, const struct FScriptDelegate& Callback);
	void NativeSelectSaveLocation(const struct FString& startCP);
	void FinishedSaveDataDialog(bool bSuccess);
	void SaveDataDialogDoneCallback(bool bSuccess);
	bool UsingFixedSaveLocation();
	bool TryStartDLCGame();
	bool ShouldShowNewDLCGame();
	bool RefreshDLC();
	bool CheckReloadForDLC();
	void RestartPlayer(class AOLPlayerController* OLPC);
};


// Class OLGame.OLCheckpointSave
// 0x0044 (0x00A4 - 0x0060)
class UOLCheckpointSave : public UObject
{
public:
	struct FString                                     Filename;                                                 // 0x0060(0x0010) (NeedCtorLink)
	struct FCheckpointTime                             SaveTime;                                                 // 0x0070(0x0010)
	struct FString                                     CheckpointName;                                           // 0x0080(0x0010) (NeedCtorLink)
	TArray<unsigned char>                              PlayerData;                                               // 0x0090(0x0010) (NeedCtorLink)
	unsigned long                                      bDeprecatedPlayerData : 1;                                // 0x00A0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLCheckpointSave");
		return ptr;
	}


	bool CheckpointIsEmpty();
};


// Class OLGame.OLConsole
// 0x0000 (0x0270 - 0x0270)
class UOLConsole : public UConsole
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLConsole");
		return ptr;
	}


	bool InputKey(int ControllerId, const struct FName& Key, TEnumAsByte<EInputEvent> Event, float AmountDepressed, bool bGamepad);
	void AddCustomCommandsToAutoComplete();
};


// Class OLGame.OLDarknessVolume
// 0x0004 (0x02D8 - 0x02D4)
class AOLDarknessVolume : public APhysicsVolume
{
public:
	unsigned long                                      bDark : 1;                                                // 0x02D4(0x0004) (Edit)
	unsigned long                                      bOnlyDarkWhenCrouched : 1;                                // 0x02D4(0x0004) (Edit)
	unsigned long                                      bInitiallyDark : 1;                                       // 0x02D4(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDarknessVolume");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
};


// Class OLGame.OLDLCManager
// 0x0004 (0x0114 - 0x0110)
class UOLDLCManager : public UDownloadableContentManager
{
public:
	unsigned long                                      bDLCInstalled : 1;                                        // 0x0110(0x0004)
	unsigned long                                      bFakeDLCInstalledCooked : 1;                              // 0x0110(0x0004) (Config)
	unsigned long                                      bFakeDLCInstalledLoose : 1;                               // 0x0110(0x0004) (Config)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDLCManager");
		return ptr;
	}


	bool FindAndInstallDLC();
};


// Class OLGame.OLDmgType
// 0x0008 (0x0098 - 0x0090)
class UOLDmgType : public UDamageType
{
public:
	float                                              SpeedPenaltyPctOnDamage;                                  // 0x0090(0x0004) (Config)
	float                                              SpeedPenaltyDuration;                                     // 0x0094(0x0004) (Config)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType");
		return ptr;
	}

};


// Class OLGame.OLDmgType_Electrified
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_Electrified : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_Electrified");
		return ptr;
	}

};


// Class OLGame.OLDmgType_Fell
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_Fell : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_Fell");
		return ptr;
	}

};


// Class OLGame.OLDmgType_Fire
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_Fire : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_Fire");
		return ptr;
	}

};


// Class OLGame.OLDmgType_GenericHit
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_GenericHit : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_GenericHit");
		return ptr;
	}

};


// Class OLGame.OLDmgType_NanoFog
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_NanoFog : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_NanoFog");
		return ptr;
	}

};


// Class OLGame.OLDmgType_Scripted
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_Scripted : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_Scripted");
		return ptr;
	}

};


// Class OLGame.OLDmgType_SoldierDecapitate
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_SoldierDecapitate : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_SoldierDecapitate");
		return ptr;
	}

};


// Class OLGame.OLDmgType_SoldierPunch
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_SoldierPunch : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_SoldierPunch");
		return ptr;
	}

};


// Class OLGame.OLDmgType_SoldierThrow
// 0x0000 (0x0098 - 0x0098)
class UOLDmgType_SoldierThrow : public UOLDmgType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDmgType_SoldierThrow");
		return ptr;
	}

};


// Class OLGame.OLDoor
// 0x17C8 (0x1A08 - 0x0240)
class AOLDoor : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObject;                     // 0x0240(0x0008) (Const, Native, NoExport)
	struct FPointer                                    VfTable_IInterface_NavMeshPathObstacle;                   // 0x0248(0x0008) (Const, Native, NoExport)
	class UStaticMeshComponent*                        Mesh;                                                     // 0x0250(0x0008) (ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        DoorMainMesh;                                             // 0x0258(0x0008) (Edit, ExportObject, Component, EditInline)
	class USkeletalMeshComponent*                      BreakingForwardMesh;                                      // 0x0260(0x0008) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BreakingForwardAnim;                                      // 0x0268(0x0008) (Edit)
	class USkeletalMeshComponent*                      BrokenForwardMesh;                                        // 0x0270(0x0008) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BrokenForwardAnim;                                        // 0x0278(0x0008) (Edit)
	class USkeletalMeshComponent*                      BreakingBackwardMesh;                                     // 0x0280(0x0008) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BreakingBackwardAnim;                                     // 0x0288(0x0008) (Edit)
	class USkeletalMeshComponent*                      BrokenBackwardMesh;                                       // 0x0290(0x0008) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BrokenBackwardAnim;                                       // 0x0298(0x0008) (Edit)
	class UDynamicLightEnvironmentComponent*           DoorMainLightEnvironment;                                 // 0x02A0(0x0008) (Edit, ExportObject, Component, EditInline)
	class UOLSoundConnectorComponent*                  SoundConnectorComp;                                       // 0x02A8(0x0008) (Edit, ExportObject, Component, EditInline)
	class UOLWaitPointComponent*                       WaitPointComponent;                                       // 0x02B0(0x0008) (Edit, ExportObject, Component, EditInline)
	float                                              InitialOpenAngle;                                         // 0x02B8(0x0004) (Edit)
	float                                              MaxOpenAngle;                                             // 0x02BC(0x0004) (Edit, EditConst)
	float                                              PlayerOpenedAngle;                                        // 0x02C0(0x0004) (Edit, EditConst)
	unsigned long                                      bReverseDirection : 1;                                    // 0x02C4(0x0004) (Edit)
	unsigned long                                      bLocked : 1;                                              // 0x02C4(0x0004) (Edit)
	unsigned long                                      bFakeUnlocked : 1;                                        // 0x02C4(0x0004) (Edit)
	unsigned long                                      bNoLockedInteraction : 1;                                 // 0x02C4(0x0004) (Edit)
	unsigned long                                      bAutoClose : 1;                                           // 0x02C4(0x0004) (Edit)
	unsigned long                                      bCantClose : 1;                                           // 0x02C4(0x0004) (Edit)
	unsigned long                                      bNoPushKnob : 1;                                          // 0x02C4(0x0004) (Edit)
	unsigned long                                      bAICanUseDoor : 1;                                        // 0x02C4(0x0004) (Edit)
	unsigned long                                      bAITraversing : 1;                                        // 0x02C4(0x0004)
	unsigned long                                      bDontBreak : 1;                                           // 0x02C4(0x0004) (Edit)
	unsigned long                                      bAlwaysBreak : 1;                                         // 0x02C4(0x0004) (Edit)
	unsigned long                                      bWaitForTriggerToBreak : 1;                               // 0x02C4(0x0004) (Edit)
	unsigned long                                      bTrimToDoorForInvestigate : 1;                            // 0x02C4(0x0004) (Edit)
	unsigned long                                      bSplitNavMesh : 1;                                        // 0x02C4(0x0004) (Edit)
	unsigned long                                      bAIAlwaysCloses : 1;                                      // 0x02C4(0x0004) (Edit)
	unsigned long                                      bUseObstacleOnClose : 1;                                  // 0x02C4(0x0004) (Edit)
	unsigned long                                      bPlayingLockedAnim : 1;                                   // 0x02C4(0x0004)
	unsigned long                                      bPlayingBlockedAnim : 1;                                  // 0x02C4(0x0004)
	unsigned long                                      bPlayingAutoCloseAnim : 1;                                // 0x02C4(0x0004)
	unsigned long                                      bBreakTriggered : 1;                                      // 0x02C4(0x0004)
	unsigned long                                      bBlocked : 1;                                             // 0x02C4(0x0004)
	unsigned long                                      bWasInitiallyLocked : 1;                                  // 0x02C4(0x0004)
	unsigned long                                      bInstantBreak : 1;                                        // 0x02C4(0x0004)
	unsigned long                                      bPreciseCloseTiming : 1;                                  // 0x02C4(0x0004)
	unsigned long                                      bObstacleRegistered : 1;                                  // 0x02C4(0x0004)
	unsigned long                                      bPlayingOpeningSound : 1;                                 // 0x02C4(0x0004)
	float                                              OpeningSpeed;                                             // 0x02C8(0x0004) (Edit)
	float                                              ClosingSpeed;                                             // 0x02CC(0x0004) (Edit)
	float                                              ExplicitOcclusionFactor;                                  // 0x02D0(0x0004) (Edit)
	float                                              DefaultOcclusionFactor;                                   // 0x02D4(0x0004) (Edit, EditConst)
	class AOLCSA*                                      UnlockingCSA;                                             // 0x02D8(0x0008) (Edit)
	float                                              LockerOpeningSpeed;                                       // 0x02E0(0x0004) (Const)
	float                                              LockerClosingSpeed;                                       // 0x02E4(0x0004) (Const)
	float                                              StaticOffsetFwdToCenterNormal;                            // 0x02E8(0x0004) (Const)
	float                                              StaticOffsetFwdToCenterLocker;                            // 0x02EC(0x0004) (Const)
	float                                              LockedAnimTotalTime;                                      // 0x02F0(0x0004) (Const)
	float                                              LockedAnimAmplitude;                                      // 0x02F4(0x0004) (Const)
	float                                              BlockedAnimTotalTime;                                     // 0x02F8(0x0004) (Const)
	float                                              BlockedAnimAmplitude;                                     // 0x02FC(0x0004) (Const)
	float                                              AutoCloseAnimTotalTime;                                   // 0x0300(0x0004) (Const)
	float                                              AutoCloseAnimAmplitude;                                   // 0x0304(0x0004) (Const)
	TEnumAsByte<EOLDoorType>                           DoorType;                                                 // 0x0308(0x0001) (Edit)
	TEnumAsByte<EDoorMaterial>                         DoorMaterial;                                             // 0x0309(0x0001)
	TEnumAsByte<EOLDoorMeshType>                       DoorMeshType;                                             // 0x030A(0x0001) (Edit)
	TEnumAsByte<EDoorState>                            DoorState;                                                // 0x030B(0x0001)
	TEnumAsByte<EDoorBreakState>                       DoorBreakState;                                           // 0x030C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x030D(0x0003) MISSED OFFSET
	struct FDoorMeshTypeData                           DoorMeshData[0x18];                                       // 0x0310(0x00E8) (NeedCtorLink)
	TArray<class UMaterialInstance*>                   MaterialOverrides;                                        // 0x18D0(0x0010) (Edit, NeedCtorLink)
	class UPhysicsAsset*                               LeftPhysicsAsset;                                         // 0x18E0(0x0008) (Const)
	class UPhysicsAsset*                               RightPhysicsAsset;                                        // 0x18E8(0x0008) (Const)
	struct FVector                                     DoorKnobOffset;                                           // 0x18F0(0x000C) (Edit)
	float                                              PathPointOffset;                                          // 0x18FC(0x0004) (Edit)
	int                                                NumBashesAfterBlocked;                                    // 0x1900(0x0004) (Edit)
	float                                              AIOpenDoorKnockback;                                      // 0x1904(0x0004) (Edit)
	float                                              OpenRatio;                                                // 0x1908(0x0004)
	float                                              TargetOpenRatio;                                          // 0x190C(0x0004) (Transient)
	float                                              CurrentSpeed;                                             // 0x1910(0x0004) (Const)
	float                                              ProceduralAnimElapsedTime;                                // 0x1914(0x0004)
	float                                              PreciseCloseDuration;                                     // 0x1918(0x0004)
	float                                              PreciseCloseStartTime;                                    // 0x191C(0x0004)
	struct FDoorShakeData                              ShakeData;                                                // 0x1920(0x0040)
	struct FDoorShakeData                              BashShakeData;                                            // 0x1960(0x0040) (Edit)
	class AOLPawn*                                     DoorUser;                                                 // 0x19A0(0x0008)
	class AOLBot*                                      ActiveBot;                                                // 0x19A8(0x0008)
	TArray<class AOLBot*>                              Bots;                                                     // 0x19B0(0x0010) (NeedCtorLink)
	struct FVector                                     Edge0Dest;                                                // 0x19C0(0x000C)
	struct FVector                                     Edge1Dest;                                                // 0x19CC(0x000C)
	float                                              LastInteractiveSoundTime;                                 // 0x19D8(0x0004)
	float                                              OpeningIntensity;                                         // 0x19DC(0x0004)
	TArray<struct FDoorSoundEvents>                    Sounds;                                                   // 0x19E0(0x0010) (Const, NeedCtorLink)
	class UAkEvent*                                    SndStopOpening;                                           // 0x19F0(0x0008) (Const)
	class UAkEvent*                                    SndLockerBash;                                            // 0x19F8(0x0008) (Const)
	struct FName                                       RTPCOpeningDoorIntensity;                                 // 0x1A00(0x0008) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLDoor");
		return ptr;
	}


	void BreakDoor(class AOLPawn* Breaker, bool bReversed);
	void BashDoor(bool bReversed);
	bool ShouldBreak(class AOLBot* Bot);
	void OnDestroy(class USeqAct_Destroy* Action);
	void SoftDestroy();
	void NotifyHandlesToWait();
	void NotifyHandlesToRepath();
	float GetOpenAngle();
	void TriggerEvent(TEnumAsByte<EDoorEventType> EventType, class AOLPawn* Triggerer);
	void TriggerBreakDoorCameraShake();
	void StopShaking();
	void StartShaking(const struct FDoorShakeData& ShakeParams, bool bSwitchToBreakingMesh, bool bReversed, bool bFromAI);
	bool IsBroken();
	void UnregisterNavmeshObstacle();
	void RegisterNavMeshObstacle();
	struct FVector ScriptGetCenterLocation();
};


// Class OLGame.OLElectrifiedVolume
// 0x0014 (0x02E8 - 0x02D4)
class AOLElectrifiedVolume : public APhysicsVolume
{
public:
	unsigned long                                      bElectrified : 1;                                         // 0x02D4(0x0004) (Edit)
	int                                                TouchDamage;                                              // 0x02D8(0x0004) (Edit)
	float                                              Knockback;                                                // 0x02DC(0x0004) (Edit)
	class UAkEvent*                                    SoundEvent;                                               // 0x02E0(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLElectrifiedVolume");
		return ptr;
	}


	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void OnToggle(class USeqAct_Toggle* Action);
};


// Class OLGame.OLElectrifiedWaterVolume
// 0x0004 (0x02D8 - 0x02D4)
class AOLElectrifiedWaterVolume : public APhysicsVolume
{
public:
	unsigned long                                      bElectrified : 1;                                         // 0x02D4(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLElectrifiedWaterVolume");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
};


// Class OLGame.OLFloorMaterialVolume
// 0x0010 (0x028C - 0x027C)
class AOLFloorMaterialVolume : public AVolume
{
public:
	unsigned long                                      bEnabled : 1;                                             // 0x027C(0x0004) (Edit)
	int                                                Priority;                                                 // 0x0280(0x0004) (Edit)
	class UPhysicalMaterial*                           PhysMaterial;                                             // 0x0284(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLFloorMaterialVolume");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
};


// Class OLGame.OLFXHolder
// 0x0000 (0x0240 - 0x0240)
class AOLFXHolder : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLFXHolder");
		return ptr;
	}

};


// Class OLGame.OLFXManager
// 0x0400 (0x0460 - 0x0060)
class UOLFXManager : public UObject
{
public:
	struct FPostProcessSettings                        NVPPSSettings;                                            // 0x0060(0x0160) (NeedCtorLink)
	struct FPostProcessSettings                        DeathPPSSettings;                                         // 0x01C0(0x0160) (NeedCtorLink)
	class UPostProcessChain*                           DefaultPPSChain;                                          // 0x0320(0x0008)
	class UPostProcessChain*                           CamcorderPPSChain;                                        // 0x0328(0x0008)
	class UPostProcessChain*                           CamcorderPPSChainConsole;                                 // 0x0330(0x0008)
	class UPostProcessChain*                           NVPPSChain;                                               // 0x0338(0x0008)
	class UPostProcessChain*                           GammaCalibrationPPSChain;                                 // 0x0340(0x0008)
	TArray<class UMaterialInstanceConstant*>           NVSensitiveMaterials;                                     // 0x0348(0x0010) (NeedCtorLink)
	class UMaterialInstanceConstant*                   CameraGlitchMat;                                          // 0x0358(0x0008)
	class UOLUberPostProcessEffect*                    CurrentUberPostEffect;                                    // 0x0360(0x0008)
	class UParticleSystemComponent*                    ElectricSparksParticles;                                  // 0x0368(0x0008) (ExportObject, Component, EditInline)
	class AOLFXHolder*                                 FXHolder;                                                 // 0x0370(0x0008)
	struct FName                                       UberPostEffectName;                                       // 0x0378(0x0008)
	struct FName                                       CameraGlitchEffectName;                                   // 0x0380(0x0008)
	struct FName                                       NVParamName;                                              // 0x0388(0x0008)
	struct FName                                       NVLightParamName;                                         // 0x0390(0x0008)
	struct FName                                       CameraGlitchParamName;                                    // 0x0398(0x0008)
	float                                              CamcorderPPSOpacity;                                      // 0x03A0(0x0004)
	float                                              CurrentElectricEffect;                                    // 0x03A4(0x0004)
	float                                              LastSetElectricEffect;                                    // 0x03A8(0x0004)
	float                                              CurrentHurtEffect;                                        // 0x03AC(0x0004)
	float                                              LastSetHurtEffect;                                        // 0x03B0(0x0004)
	unsigned long                                      bShowingHurtEffect : 1;                                   // 0x03B4(0x0004)
	unsigned long                                      bShowingElectricityEffect : 1;                            // 0x03B4(0x0004)
	unsigned long                                      bSwarmBlurActive : 1;                                     // 0x03B4(0x0004)
	unsigned long                                      bShatteredGlassEffectActive : 1;                          // 0x03B4(0x0004)
	TEnumAsByte<EPPSMode>                              CurrentPPSMode;                                           // 0x03B8(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x03B9(0x0003) MISSED OFFSET
	struct FBlurData                                   CurrentBlur;                                              // 0x03BC(0x001C)
	struct FBlurData                                   HeatBlur;                                                 // 0x03D8(0x001C)
	float                                              SwarmBlurAmount;                                          // 0x03F4(0x0004)
	struct FCameraGlitchData                           CameraGlitch;                                             // 0x03F8(0x0018)
	class UAkEvent*                                    SndCameraGlitch;                                          // 0x0410(0x0008) (Const)
	struct FString                                     CameraGlitchIntensity;                                    // 0x0418(0x0010) (Const, NeedCtorLink)
	struct FMovieEffectData                            MovieEffect;                                              // 0x0428(0x0030) (NeedCtorLink)
	struct FName                                       MovieEffectRTPC;                                          // 0x0458(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class OLGame.OLFXManager");
		return ptr;
	}


	void SetFXForEnemyPawn(class AOLEnemyPawn* EnemyPawn);
	void DeactivateNightVisionEffect();
